Revit 2027 API
FabricationPart.CanFlipPart Method
 Validates if the fabrication part is one of the supported fabrication part types that can be flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFlipPart()
Public Function CanFlipPart As Boolean
public:
bool CanFlipPart()
member CanFlipPart : unit -> bool
Return Value
Boolean
 Returns true if valid otherwise false if the fabrication part cannot be flipped.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace